In [2]:
import pandas as pd;import numpy as np

In [4]:
s=pd.Series(["ege",np.nan,"ali","eda"])

In [5]:
s

0    ege
1    NaN
2    ali
3    eda
dtype: object

In [6]:
s.isnull()

0    False
1     True
2    False
3    False
dtype: bool

In [7]:
s.notnull()

0     True
1    False
2     True
3     True
dtype: bool

In [9]:
s[3]=None

In [10]:
s.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [11]:
s.dropna()

0    ege
2    ali
dtype: object

In [12]:
s[s.notnull()]

0    ege
2    ali
dtype: object

In [13]:
from numpy import nan as NA

In [15]:
df=pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [16]:
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [17]:
df.dropna(how="all")

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [18]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [19]:
df[1]=NA

In [20]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [22]:
df.dropna(axis=1,how="all")

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [23]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [26]:
df.dropna(thresh=1)

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0

In [27]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [28]:
df.fillna(0)

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [29]:
df.fillna({0:15,1:25,2:35})

      0     1     2
0   1.0  25.0   3.0
1   4.0  25.0   5.0
2  15.0  25.0  35.0

In [30]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [31]:
df.fillna(0,inplace=True)

In [32]:
df

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [33]:
df=pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [34]:
df.fillna(method="ffill")

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

In [39]:
df.fillna(method="ffill",limit=1)

0    1.0
1    0.0
2    NaN
3    5.0
dtype: float64

In [40]:
veri=pd.Series([1,0,NA,5])
veri

0    1.0
1    0.0
2    NaN
3    5.0
dtype: float64

In [41]:
veri.fillna(veri.mean())

0    1.0
1    0.0
2    2.0
3    5.0
dtype: float64

In [42]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [44]:
df.fillna(df.mean())

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  2.5  2.0  4.0